In [1]:
import numpy as np  # 라이브러리 가져옴
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
# 1차원 배열 => Series = 인덱스(index) + 값(data)
obj = pd.Series([3, 6, 9, 12])
obj # 인덱스 값 / dtype - 데이터자료형

0     3
1     6
2     9
3    12
dtype: int64

In [3]:
# 문자열 인덱스를 활용
#obj = pd.Series(index=)  # 인덱스 위치 순서 어디있든 상관x
obj = pd.Series([3, 6, 9, 12], 
                index=["a","b","c","d"])
obj

a     3
b     6
c     9
d    12
dtype: int64

In [7]:
s = pd.Series(range(10, 14), 
              index=["서울","대전","대구","부산"])
s

서울    10
대전    11
대구    12
부산    13
dtype: int64

In [9]:
# Series.index 속성  - 인덱스값만 가져옴
s.index

Index(['서울', '대전', '대구', '부산'], dtype='object')

In [10]:
# Series.values 속성 - Series객체에서 값만 가져옴
s.values

array([10, 11, 12, 13], dtype=int64)

In [18]:
s.name = "인구"
s.index.name = "도시"
s

도시
서울    10
대전    11
대구    12
부산    13
Name: 인구, dtype: int64

In [19]:
# 2차원 배열 DataFrame, Table(표, 행과 열)
d = pd.DataFrame([[10, 20, 30], 
                  [40, 50, 60],
                  [70, 80, 90]])
d   # 행row 열column

    0   1   2
0  10  20  30
1  40  50  60
2  70  80  90

In [21]:
d = pd.DataFrame([[10, 20, 30], 
                  [40, 50, 60],
                  [70, 80, 90]],
                 columns=['aaa','bbb','ccc'])
d

   aaa  bbb  ccc
0   10   20   30
1   40   50   60
2   70   80   90

In [22]:
# Dictionary를 데이터프레임으로 변환이 가능하다.
tbl = pd.DataFrame({
    "체중":[80, 70.4, 65.6, 45.9, 51.2],
    "신장":[170, 180, 155, 143, 154],
    "성별":["남","여","남","남","여"]
}) 
tbl # 데이터 필드의 크기는 같아야한다

     체중   신장 성별
0  80.0  170  남
1  70.4  180  여
2  65.6  155  남
3  45.9  143  남
4  51.2  154  여

In [24]:
s

도시
서울    10
대전    11
대구    12
부산    13
Name: 인구, dtype: int64

In [27]:
s[1]

11

In [26]:
s['대전']

11

In [30]:
s[[0, 3]] # 하나 이상의 값은 factor화 해야함,, 대괄호로 묶어줌

도시
서울    10
부산    13
Name: 인구, dtype: int64

In [31]:
s[["서울", "부산", "대전"]]

도시
서울    10
부산    13
대전    11
Name: 인구, dtype: int64

In [32]:
s[s > 11]  # 대괄호 안에 조건을 넣을 수 있다

도시
대구    12
부산    13
Name: 인구, dtype: int64

In [33]:
s[1:3]  # 1,2인덱스의 값

도시
대전    11
대구    12
Name: 인구, dtype: int64

In [34]:
s

도시
서울    10
대전    11
대구    12
부산    13
Name: 인구, dtype: int64

In [35]:
s["부산":"대전":-1]

도시
부산    13
대구    12
대전    11
Name: 인구, dtype: int64

In [36]:
s["대전":"부산"]

도시
대전    11
대구    12
부산    13
Name: 인구, dtype: int64

In [37]:
s0 = pd.Series(range(3), index=["a","b","c"])
s0

a    0
b    1
c    2
dtype: int64

In [38]:
# direct 연산자(.)
s0.a

0

In [39]:
s0.c

2

In [40]:
"서울" in s  # 인덱스의 라벨 중에 서울이 있습니까?

True

In [41]:
for k, v in s.items():
    print("%s = %d" % (k, v))

서울 = 10
대전 = 11
대구 = 12
부산 = 13

In [42]:
s2 = pd.Series({"서울":9631482, "부산":6393191,
               "인천":3632935, "대전":4490158})
s2  # dictionary의 key가 index가 됨

서울    9631482
부산    6393191
인천    3632935
대전    4490158
dtype: int64

In [44]:
s2['대전']=3490187
s2

서울    9631482
부산    6393191
인천    3632935
대전    3490187
dtype: int64

In [45]:
del s2["서울"]
s2

부산    6393191
인천    3632935
대전    3490187
dtype: int64

In [46]:
tbl

     체중   신장 성별
0  80.0  170  남
1  70.4  180  여
2  65.6  155  남
3  45.9  143  남
4  51.2  154  여

In [47]:
tbl["체중"]

0    80.0
1    70.4
2    65.6
3    45.9
4    51.2
Name: 체중, dtype: float64

In [50]:
tbl[["신장", "체중"]]

    신장    체중
0  170  80.0
1  180  70.4
2  155  65.6
3  143  45.9
4  154  51.2

In [55]:
# 성별이 남자인 데이터만 추출
tbl[tbl.성별 == "남"]  # (.)찍을 때는 (")하지 않음

     체중   신장 성별
0  80.0  170  남
2  65.6  155  남
3  45.9  143  남

In [56]:
tbl[tbl.성별 == "여"]

     체중   신장 성별
1  70.4  180  여
4  51.2  154  여

In [73]:
# 딕셔너리 생성
data = {
    "2015":[9904312, 3448737, 2890451, 24466052],
    "2010":[9631482, 3393191, 2632035, 2431774],
    "2005":[9762546, 3512547, 2517689, 2456016],
    "2000":[9853972, 3655437, 2466338, 2473990],
    "지역":["수도권", "경상권","수도권","경상권"],
    "2010-2015 증가율":[0.0283, 0.0163, 0.0982, 0.0141]
}

# 딕셔너리를 이용해서 데이터프레임 생성
# 행인덱스 : index, 열인덱스 : columns
columns = ["지역","2015","2010","2005",
           "2000","2010-2015 증가율"]
index = ["서울","부산","인천","대구"]

df = pd.DataFrame(data)
df

       2015     2010     2005     2000   지역  2010-2015 증가율
0   9904312  9631482  9762546  9853972  수도권         0.0283
1   3448737  3393191  3512547  3655437  경상권         0.0163
2   2890451  2632035  2517689  2466338  수도권         0.0982
3  24466052  2431774  2456016  2473990  경상권         0.0141

In [77]:
df = pd.DataFrame(data, index=index, columns=columns)
df

     지역      2015     2010     2005     2000  2010-2015 증가율
서울  수도권   9904312  9631482  9762546  9853972         0.0283
부산  경상권   3448737  3393191  3512547  3655437         0.0163
인천  수도권   2890451  2632035  2517689  2466338         0.0982
대구  경상권  24466052  2431774  2456016  2473990         0.0141

In [62]:
# values
df.values  # object - 객체, 문자열

array([['수도권', 9904312, 9631482, 9762546, 9853972, 0.0283],
       ['경상권', 3448737, 3393191, 3512547, 3655437, 0.0163],
       ['수도권', 2890451, 2632035, 2517689, 2466338, 0.0982],
       ['경상권', 24466052, 2431774, 2456016, 2473990, 0.0141]], dtype=object)

In [63]:
df.columns  # 필드명

Index(['지역', '2015', '2010', '2005', '2000', '2010-2015 증가율'], dtype='object')

In [64]:
df.index

Index(['서울', '부산', '인천', '대구'], dtype='object')

In [65]:
# 열 방향의 인덱스와 행 방향의 인덱스에 이름 생성
df.index.name = "도시"
df.columns.name = "특성"
df

특성   지역      2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권   9904312  9631482  9762546  9853972         0.0283
부산  경상권   3448737  3393191  3512547  3655437         0.0163
인천  수도권   2890451  2632035  2517689  2466338         0.0982
대구  경상권  24466052  2431774  2456016  2473990         0.0141

In [66]:
df.T  # 전치

도시                  서울       부산       인천        대구
특성
지역                 수도권      경상권      수도권       경상권
2015           9904312  3448737  2890451  24466052
2010           9631482  3393191  2632035   2431774
2005           9762546  3512547  2517689   2456016
2000           9853972  3655437  2466338   2473990
2010-2015 증가율   0.0283   0.0163   0.0982    0.0141

In [80]:
df["2010-2015 증가율"] = df["2010-2015 증가율"] * 100
df

     지역      2015     2010     2005     2000  2010-2015 증가율
서울  수도권   9904312  9631482  9762546  9853972           2.83
부산  경상권   3448737  3393191  3512547  3655437           1.63
인천  수도권   2890451  2632035  2517689  2466338           9.82
대구  경상권  24466052  2431774  2456016  2473990           1.41

In [79]:
df["지역"]

서울    수도권
부산    경상권
인천    수도권
대구    경상권
Name: 지역, dtype: object

In [78]:
df[["2010", "2015"]]

       2010      2015
서울  9631482   9904312
부산  3393191   3448737
인천  2632035   2890451
대구  2431774  24466052